  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/d6c21d63-5470-4213-81a1-74e25ffbdc23/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

# module.eastus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus2"
    + max_bid_price                   = -1
    + name                            = "eastus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus2"
    + mac_address                   = (known after apply)
    + name                          = "eastus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/VmSubnet"
      }
  }

# module.eastus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "eastus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

# module.west-vms[0].azurerm_linux_virtual_machine.vm will be destroyed
# (because azurerm_linux_virtual_machine.vm is not in configuration)
- resource "azurerm_linux_virtual_machine" "vm" {
    - admin_username                  = "adminuser" -> null
    - allow_extension_operations      = true -> null
    - computer_name                   = "west-vm-0" -> null
    - disable_password_authentication = true -> null
    - encryption_at_host_enabled      = false -> null
    - extensions_time_budget          = "PT1H30M" -> null
    - id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/west-vm-0" -> null
    - location                        = "westus2" -> null
    - max_bid_price                   = -1 -> null
    - name                            = "west-vm-0" -> null
    - network_interface_ids           = [
        - "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/west-vm-0-nic",
      ] -> null
    - patch_mode                      = "ImageDefault" -> null
    - platform_fault_domain           = -1 -> null
    - priority                        = "Regular" -> null
    - private_ip_address              = "10.1.1.4" -> null
    - private_ip_addresses            = [
        - "10.1.1.4",
      ] -> null
    - provision_vm_agent              = true -> null
    - public_ip_address               = "4.154.97.169" -> null
    - public_ip_addresses             = [
        - "4.154.97.169",
      ] -> null
    - resource_group_name             = "org-jcetina-repo-baklava-rg" -> null
    - secure_boot_enabled             = false -> null
    - size                            = "Standard_F2" -> null
    - tags                            = {} -> null
    - virtual_machine_id              = "6808d1c4-a894-4db6-afb3-1035d94278de" -> null
    - vtpm_enabled                    = false -> null

    - admin_ssh_key {
        - public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT -> null
        - username   = "adminuser" -> null
      }

    - os_disk {
        - caching                   = "ReadWrite" -> null
        - disk_size_gb              = 30 -> null
        - name                      = "west-vm-0_OsDisk_1_a8be9cabc104418e889230198ed8aac3" -> null
        - storage_account_type      = "Standard_LRS" -> null
        - write_accelerator_enabled = false -> null
      }

    - source_image_reference {
        - offer     = "0001-com-ubuntu-server-focal" -> null
        - publisher = "Canonical" -> null
        - sku       = "20_04-lts" -> null
        - version   = "latest" -> null
      }
  }

# module.west-vms[0].azurerm_network_interface.nic will be destroyed
# (because azurerm_network_interface.nic is not in configuration)
- resource "azurerm_network_interface" "nic" {
    - applied_dns_servers           = [] -> null
    - dns_servers                   = [] -> null
    - enable_accelerated_networking = false -> null
    - enable_ip_forwarding          = false -> null
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/west-vm-0-nic" -> null
    - internal_domain_name_suffix   = "qbj5o2spbl2ete2qfw1fvi24fb.xx.internal.cloudapp.net" -> null
    - location                      = "westus2" -> null
    - mac_address                   = "00-0D-3A-6D-2E-D5" -> null
    - name                          = "west-vm-0-nic" -> null
    - private_ip_address            = "10.1.1.4" -> null
    - private_ip_addresses          = [
        - "10.1.1.4",
      ] -> null
    - resource_group_name           = "org-jcetina-repo-baklava-rg" -> null
    - tags                          = {} -> null
    - virtual_machine_id            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/west-vm-0" -> null

    - ip_configuration {
        - name                          = "internal" -> null
        - primary                       = true -> null
        - private_ip_address            = "10.1.1.4" -> null
        - private_ip_address_allocation = "Dynamic" -> null
        - private_ip_address_version    = "IPv4" -> null
        - public_ip_address_id          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/west-vm-0-public-ip" -> null
        - subnet_id                     = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet" -> null
      }
  }

# module.west-vms[0].azurerm_public_ip.public_ip[0] will be destroyed
# (because azurerm_public_ip.public_ip is not in configuration)
- resource "azurerm_public_ip" "public_ip" {
    - allocation_method       = "Static" -> null
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/west-vm-0-public-ip" -> null
    - idle_timeout_in_minutes = 4 -> null
    - ip_address              = "4.154.97.169" -> null
    - ip_tags                 = {} -> null
    - ip_version              = "IPv4" -> null
    - location                = "westus2" -> null
    - name                    = "west-vm-0-public-ip" -> null
    - resource_group_name     = "org-jcetina-repo-baklava-rg" -> null
    - sku                     = "Standard" -> null
    - sku_tier                = "Regional" -> null
    - tags                    = {} -> null
    - zones                   = [] -> null
  }

# module.westus2-vms[0].azurerm_linux_virtual_machine.vm will be created
+ resource "azurerm_linux_virtual_machine" "vm" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "westus2"
    + max_bid_price                   = -1
    + name                            = "westus2-vm-0"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDXfeNESzeBpNFl0W8801NXA+539N6Q06VPKFV63alXC77aoNgNBNU16jDajStBz7zA6brxhwhwTR9V4zQwLJxLkmq2oO8mm1zqy1AgeWC2/zwvp7PJ1Md7vNbmERInJ6FN8C6Xa7jf3NbFQfnaodnb9j+zuFKN4HGi0+Su/EUzvMAqeMS1RjFTxQGhpG0zRdHL9sqnKKR2c9S3/XSWNFej3XFueuMhUnGqyv84vVZYx6SpH383wFIa7Y1p+Skkf3o9WQsQ6pdGvcTIDx6V4+vo5lKUmMOHLiJNx3fGjoDHIDbnhT1GH2Hb8IjFkUKfRqCLr1zKxiWoMxmb/Ipx0FnF jcetina@Jasons-MBP
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "0001-com-ubuntu-server-focal"
        + publisher = "Canonical"
        + sku       = "20_04-lts"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# module.westus2-vms[0].azurerm_network_interface.nic will be created
+ resource "azurerm_network_interface" "nic" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "westus2"
    + mac_address                   = (known after apply)
    + name                          = "westus2-vm-0-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + public_ip_address_id                               = (known after apply)
        + subnet_id                                          = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/VmSubnet"
      }
  }

# module.westus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "westus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 6 to add, 0 to change, 3 to destroy.
module.west-vms[0].azurerm_linux_virtual_machine.vm: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/west-vm-0]
module.eastus2-vms[0].azurerm_public_ip.public_ip[0]: Creating...
module.westus2-vms[0].azurerm_public_ip.public_ip[0]: Creating...
module.eastus2-vms[0].azurerm_public_ip.public_ip[0]: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-vm-0-public-ip]
module.eastus2-vms[0].azurerm_network_interface.nic: Creating...
module.westus2-vms[0].azurerm_public_ip.public_ip[0]: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/westus2-vm-0-public-ip]
module.westus2-vms[0].azurerm_network_interface.nic: Creating...
module.eastus2-vms[0].azurerm_network_interface.nic: Creation complete after 1s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Creating...
module.westus2-vms[0].azurerm_network_interface.nic: Creation complete after 2s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Creating...
module.west-vms[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...soft.Compute/virtualMachines/west-vm-0, 10s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [10s elapsed]
module.west-vms[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...soft.Compute/virtualMachines/west-vm-0, 20s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [20s elapsed]
module.west-vms[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...soft.Compute/virtualMachines/west-vm-0, 30s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [30s elapsed]
module.west-vms[0].azurerm_linux_virtual_machine.vm: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...soft.Compute/virtualMachines/west-vm-0, 40s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still creating... [40s elapsed]
module.west-vms[0].azurerm_linux_virtual_machine.vm: Destruction complete after 48s
module.west-vms[0].azurerm_network_interface.nic: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/west-vm-0-nic]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Creation complete after 49s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/eastus2-vm-0]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Creation complete after 48s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/westus2-vm-0]
module.west-vms[0].azurerm_network_interface.nic: Destruction complete after 5s
module.west-vms[0].azurerm_public_ip.public_ip[0]: Destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/west-vm-0-public-ip]
module.west-vms[0].azurerm_public_ip.public_ip[0]: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-.../publicIPAddresses/west-vm-0-public-ip, 10s elapsed]
module.west-vms[0].azurerm_public_ip.public_ip[0]: Still destroying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-.../publicIPAddresses/west-vm-0-public-ip, 20s elapsed]
module.west-vms[0].azurerm_public_ip.public_ip[0]: Destruction complete after 21s

Apply complete! Resources: 6 added, 0 changed, 3 destroyed.
```

  </details>